# Пользователь вводит порядковый номер пальца руки.
# Необходимо показать его название на экран.

a = ['', 'большой', 'указательный', 'средний', 'безымянный', 'мизинец'][int(input()) + 1]
print(a)
