# Создайте 4 переменные с разными типами данных
# и предложите пользователю ввести в них значения.
# После ввода, отобразите их на экране.

print('Целое')
a = int(input())
print('Вещественное')
b = float(input())
print('Строковое')
c = str(input())
print('1 или 0')
d = bool(int(input()))
print(a, b, c, d)
