# Вывести на экран текст в таком виде:

text = '''А почему в ресторане ей никогда не нравится то,
что заказала она, и всегда нравится то, что заказал я?
И она начинает есть у меня из тарелки. Я ей говорю:
«Закажи себе то же самое». Она говорит: «Зачем?
Я только попробовать». И съедает половину.
    // И к.ф. “О чем говорят мужчины” //
'''

print(text)
