# Создайте 4 переменные с разными типами данных
# и предложите пользователю ввести в них значения.
# После ввода, отобразите их на экране.

type_int = int(input('Целое число: '))
type_float = float(input('Вещественное число: '))
type_str = input('Строковое значение: ')
type_bool = input('Логическое значение: ') == 'True'

print(type_int, type_float, type_str, type_bool)

#   Целое число: 5
#   Вещественное число: 4.3
#   Строковое значение: Zinkin
#   Логическое значение: True
# > 5 4.3 Zinkin Trueё
