# Вывести на экран текст в таком виде:

print('А почему в ресторане ей никогда не нравится то,')
print('что заказала она, и всегда нравится то, что заказал я?')
print('И она начинает есть у меня из тарелки. Я ей говорю:')
print('«Закажи себе то же самое». Она говорит: «Зачем?')
print('Я только попробовать». И съедает половину.')
print('    // И к.ф. “О чем говорят мужчины” //')
