# Создайте 5 переменных типа char,
# предложите пользователю ввести слово из пяти букв
# и покажите эти символы (слово) на экран.

print('Слово')
a = list(input())
print(*a)
