# Создайте 5 переменных типа char,
# предложите пользователю ввести слово из пяти букв
# и покажите эти символы (слово) на экран.

l1, l2, l3, l4, l5 = input('Слово из пяти букв: ')
print(l1, l2, l3, l4, l5)

# Слово из пяти букв: Артём
# > А р т ё м
