# Дано четырехзначное число (к примеру 5678),
# вывести на экран в обратном порядке цифры,
# из которых это число состоит.
# То есть мы должны увидеть на экране 8765.

a = input()[::-1]
print(a)
